In [1]:
import pandas as pd
import numpy as np

C:\Users\lenovo\AppData\Local\Temp\ipykernel_6836\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [64]:
df=pd.read_csv("data.csv")

In [3]:
df

   Age   Location  Price
0   18    Pune,MH   $1.2
1   20  Mumbai,MH   $1.5
2   25   Thane,MH    NaN
3   28       A,KL    NaN
4   32       B,DL   $8.2
5  115       C,MP  $10.5
6  104       D,MP    NaN

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       7 non-null      int64
 1   Location  7 non-null      object
 2   Price     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [105]:
df.isnull().sum()

Age         0
Location    0
Price       3
dtype: int64

In [99]:
#handling price problem
df=pd.read_csv("data.csv")
df["Price"]=df["Price"].str.replace("$","")
df["Price"]=df["Price"].astype(float)
m=df["Price"].mean()
m
df["Price"].fillna(m,inplace=True)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_6836\742290438.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Price"].fillna(m,inplace=True)

In [5]:
df

   Age   Location Price
0   18    Pune,MH   1.2
1   20  Mumbai,MH   1.5
2   25   Thane,MH   NaN
3   28       A,KL   NaN
4   32       B,DL   8.2
5  115       C,MP  10.5
6  104       D,MP   NaN

In [6]:
df.isnull().sum()

Age         0
Location    0
Price       3
dtype: int64

In [43]:
df["Price"]=df["Price"].astype(float)

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       7 non-null      int64
 1   Location  7 non-null      object
 2   Price     4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes

In [44]:
m=df["Price"].mean()
m

5.35

In [45]:
df["Price"].fillna(m,inplace=True)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_6836\912019705.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Price"].fillna(m,inplace=True)

In [46]:
main=df

In [47]:
main

   Age   Location  Price
0   18    Pune,MH   1.20
1   20  Mumbai,MH   1.50
2   25   Thane,MH   5.35
3   28       A,KL   5.35
4   32       B,DL   8.20
5  115       C,MP  10.50
6  104       D,MP   5.35

In [48]:
main["Age"]=main["Age"].replace(115,15)

In [50]:
main

   Age   Location  Price
0   18    Pune,MH   1.20
1   20  Mumbai,MH   1.50
2   25   Thane,MH   5.35
3   28       A,KL   5.35
4   32       B,DL   8.20
5   15       C,MP  10.50
6   14       D,MP   5.35

In [80]:
dt={"Age Group":[3,4,5,6,7,1,2]}
df2=pd.DataFrame(dt)
# df3=pd.DataFrame(columns="Age Group")

In [81]:
df2

   Age Group
0          3
1          4
2          5
3          6
4          7
5          1
6          2

## main.info()

In [100]:
main=df
main["Age"]=main["Age"].replace(104,14)
main["Age"]=main["Age"].replace(115,15)

In [101]:
main

   Age   Location  Price
0   18    Pune,MH   1.20
1   20  Mumbai,MH   1.50
2   25   Thane,MH   5.35
3   28       A,KL   5.35
4   32       B,DL   8.20
5   15       C,MP  10.50
6   14       D,MP   5.35

In [107]:
def newcol(x):
    print(x)
    if x >=18:
        return "Adult"
    elif x < 18:
        return "Teen"

In [108]:
main['Age Group']=main['Age'].map(newcol)

18
20
25
28
32
15
14

In [109]:
main

   Age   Location  Price Age Group
0   18    Pune,MH   1.20     Adult
1   20  Mumbai,MH   1.50     Adult
2   25   Thane,MH   5.35     Adult
3   28       A,KL   5.35     Adult
4   32       B,DL   8.20     Adult
5   15       C,MP  10.50      Teen
6   14       D,MP   5.35      Teen

In [115]:
def cityy(i):
    #print(i)
    a=i.split(",")[0]
    return a

In [116]:
main["city"]=main["Location"].map(cityy)

Pune,MH
Mumbai,MH
Thane,MH
A,KL
B,DL
C,MP
D,MP

In [117]:
main

   Age   Location  Price Age Group    city
0   18    Pune,MH   1.20     Adult    Pune
1   20  Mumbai,MH   1.50     Adult  Mumbai
2   25   Thane,MH   5.35     Adult   Thane
3   28       A,KL   5.35     Adult       A
4   32       B,DL   8.20     Adult       B
5   15       C,MP  10.50      Teen       C
6   14       D,MP   5.35      Teen       D

In [118]:
def statee(i):
    #print(i)
    b=i.split(",")[1]
    return b

In [119]:
main["state"]=main["Location"].map(statee)

In [120]:
main

   Age   Location  Price Age Group    city state
0   18    Pune,MH   1.20     Adult    Pune    MH
1   20  Mumbai,MH   1.50     Adult  Mumbai    MH
2   25   Thane,MH   5.35     Adult   Thane    MH
3   28       A,KL   5.35     Adult       A    KL
4   32       B,DL   8.20     Adult       B    DL
5   15       C,MP  10.50      Teen       C    MP
6   14       D,MP   5.35      Teen       D    MP